### Read a sample data in csv

In [1]:
import pandas as pd
import requests

In [2]:
url = "https://raw.githubusercontent.com/sinanuozdemir/principles_of_data_science/master/data/chapter_2/drinks.csv"

In [3]:
import os

In [4]:
working_directory = os.getcwd()

In [5]:
print (working_directory)

/Users/hanhpham/Documents/Python scripts/python sets

In [6]:
path = working_directory + '/who_dataset_drinking_habit.csv'

In [7]:
drinks= pd.read_csv(path)

In [8]:
drinks.head(1)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS

In [9]:
type(drinks)

pandas.core.frame.DataFrame

In [10]:
drinks.describe()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
count,193.000000,193.000000,193.000000,193.000000
mean,106.160622,80.994819,49.450777,4.717098
std,101.143103,88.284312,79.697598,3.773298
min,0.000000,0.000000,0.000000,0.000000
25%,20.000000,4.000000,1.000000,1.300000
50%,76.000000,56.000000,8.000000,4.200000
75%,188.000000,128.000000,59.000000,7.200000
max,376.000000,438.000000,370.000000,14.400000

In [11]:
drinks['continent'].describe()

count     170
unique      5
top        AF
freq       53
Name: continent, dtype: object

In [12]:
drinks['beer_servings'].describe()

count    193.000000
mean     106.160622
std      101.143103
min        0.000000
25%       20.000000
50%       76.000000
75%      188.000000
max      376.000000
Name: beer_servings, dtype: float64

### Bayes's theorem example

Question: Probability of a survival knowing that is a "she"?

In [13]:
path_2 = working_directory + '/who_dataset_drinking_habit.csv'

In [14]:
titanic = pd.read_csv(path_2)

In [47]:
titanic_bayes = titanic[['Sex', 'Survived']]

In [49]:
titanic_bayes.head()

      Sex  Survived
0    male         0
1  female         1
2  female         1
3  female         1
4    male         0

In [48]:
num_rows = float(titanic_bayes.shape[0])

In [52]:
p_survived = (titanic_bayes.Survived== 1).sum()/num_rows

In [62]:
num_of_women = titanic_bayes[titanic_bayes.Sex == 'female'].shape[0]
num_of_women

314

In [61]:
women_who_lived = titanic_bayes[(titanic_bayes.Sex =='female') & (titanic_bayes.Survived == 1)].shape[0]
women_who_lived

233

In [64]:
p_survived_women = women_who_lived / num_of_women
p_survived_women

0.7420382165605095